let start=datetime("2019-03-03T22:25:58.528Z");
let end=datetime("2019-03-04T22:25:58.528Z");
let timeRange=ago(14d);
let azureSignIns =  SigninLogs
|where TimeGenerated > start and TimeGenerated < end
| where TimeGenerated >= timeRange
| where SourceSystem == "Azure AD"
| where IPAddress == "217.147.169.242" or IPAddress == "91.200.14.139" or IPAddress == "217.23.5.57" or IPAddress == "5.254.98.54" or IPAddress == "5.61.39.14" or IPAddress == "50.17.189.198" or IPAddress == "50.21.187.135" or IPAddress == "50.22.86.10" or IPAddress == "50.23.98.194" or IPAddress == "50.62.235.1" or IPAddress == "50.62.31.207" or IPAddress == "50.63.56.47" or IPAddress == "50.87.146.115" or IPAddress == "50.87.151.146" or IPAddress == "50.87.153.96" or IPAddress == "50.87.18.127" or IPAddress == "50.87.72.219" or IPAddress == "50.97.234.2" or IPAddress == "52.10.128.168" or IPAddress == "52.207.234.89" or IPAddress == "54.209.159.227" or IPAddress == "54.218.45.67" or IPAddress == "54.228.191.94" or IPAddress == "54.236.134.245" or IPAddress == "54.239.172.114" or IPAddress == "54.248.126.242" or IPAddress == "54.72.9.51" or IPAddress == "58.215.169.42" or IPAddress == "58.215.240.96" or IPAddress == "58.55.127.16" or IPAddress == "59.32.213.195" or IPAddress == "60.250.76.52" or IPAddress == "61.139.126.15" or IPAddress == "61.147.75.89" or IPAddress == "61.158.145.141" or IPAddress == "61.178.85.177" or IPAddress == "61.19.251.27" or IPAddress == "61.57.227.5" or IPAddress == "41.207.222.252" or IPAddress == "101.0.89.3" or IPAddress == "101.200.81.187" or IPAddress == "103.19.89.118" or IPAddress == "103.230.84.239" or IPAddress == "103.241.0.100" or IPAddress == "103.26.128.84" or IPAddress == "103.4.52.150" or IPAddress == "103.7.59.135" or IPAddress == "107.191.46.4" or IPAddress == "109.127.8.242" or IPAddress == "109.229.210.250" or IPAddress == "109.229.36.65" or IPAddress == "113.29.230.24" or IPAddress == "116.193.77.118" or IPAddress == "120.25.63.2" or IPAddress == "120.31.134.133" or IPAddress == "120.63.157.195" or IPAddress == "123.30.129.179" or IPAddress == "124.110.195.160" or IPAddress == "128.210.157.251" or IPAddress == "149.202.242.81" or IPAddress == "151.80.52.45" or IPAddress == "151.80.52.47" or IPAddress == "151.97.190.239" or IPAddress == "157.7.170.62" or IPAddress == "160.97.52.229" or IPAddress == "162.223.94.56" or IPAddress == "177.4.23.159" or IPAddress == "180.182.234.200" or IPAddress == "185.25.117.49" or IPAddress == "185.25.119.84" or IPAddress == "185.35.138.22" or IPAddress == "185.62.188.51" or IPAddress == "185.99.133.163" or IPAddress == "186.64.120.104" or IPAddress == "187.174.252.247" or IPAddress == "188.219.154.228" or IPAddress == "188.226.141.142" or IPAddress == "188.241.140.212" or IPAddress == "188.241.140.222" or IPAddress == "188.241.140.224" or IPAddress == "188.247.135.53" or IPAddress == "188.247.135.58" or IPAddress == "188.247.135.74" or IPAddress == "188.247.135.99" or IPAddress == "190.123.35.140" or IPAddress == "190.123.35.141" or IPAddress == "190.128.29.1" or IPAddress == "190.15.192.25" or IPAddress == "192.64.11.244" or IPAddress == "192.99.148.26" or IPAddress == "192.99.19.4" or IPAddress == "193.107.17.145" or IPAddress == "193.107.17.55" or IPAddress == "193.107.17.56" or IPAddress == "193.107.19.24" or IPAddress == "193.107.19.244" or IPAddress == "193.146.210.69" or IPAddress == "193.189.117.56" or IPAddress == "193.201.227.142" or IPAddress == "194.109.64.131" or IPAddress == "194.58.103.199" or IPAddress == "194.58.56.45" or IPAddress == "195.20.40.123" or IPAddress == "195.20.41.233" or IPAddress == "195.20.42.1" or IPAddress == "195.20.44.100" or IPAddress == "195.20.44.109" or IPAddress == "195.20.46.116" or IPAddress == "198.245.202.92" or IPAddress == "199.187.129.193" or IPAddress == "199.201.121.185" or IPAddress == "199.7.234.100" or IPAddress == "2.50.11.28" or IPAddress == "201.149.83.183" or IPAddress == "202.144.144.195" or IPAddress == "202.191.62.226" or IPAddress == "202.29.22.38" or IPAddress == "202.29.230.198" or IPAddress == "202.67.13.107" or IPAddress == "202.9.36.111" or IPAddress == "203.170.193.23" or IPAddress == "209.164.84.70" or IPAddress == "210.211.108.215" or IPAddress == "210.4.76.221" or IPAddress == "212.44.64.202" or IPAddress == "213.147.67.20" or IPAddress == "216.176.100.240" or IPAddress == "216.215.112.149" or IPAddress == "217.12.202.85" or IPAddress == "222.29.197.232" or IPAddress == "23.113.113.105" or IPAddress == "23.94.5.119" or IPAddress == "23.96.196.120" or IPAddress == "24.148.217.188" or IPAddress == "24.172.94.180" or IPAddress == "24.204.49.244" or IPAddress == "27.131.149.102" or IPAddress == "27.254.55.11" or IPAddress == "31.131.139.42" or IPAddress == "31.131.251.33" or IPAddress == "31.134.100.179" or IPAddress == "31.134.73.151" or IPAddress == "31.14.134.47" or IPAddress == "31.222.155.254" or IPAddress == "31.23.128.204" or IPAddress == "31.23.80.184" or IPAddress == "31.28.103.254" or IPAddress == "31.41.44.45" or IPAddress == "31.42.172.36" or IPAddress == "31.7.63.146" or IPAddress == "37.123.99.188" or IPAddress == "37.128.132.96" or IPAddress == "37.139.30.95" or IPAddress == "37.140.195.177" or IPAddress == "37.143.11.189" or IPAddress == "37.229.126.164" or IPAddress == "37.46.131.153" or IPAddress == "37.46.135.204" or IPAddress == "37.48.125.119" or IPAddress == "37.57.177.15" or IPAddress == "37.58.112.101" or IPAddress == "37.59.61.29" or IPAddress == "37.99.146.27" or IPAddress == "38.64.199.113" or IPAddress == "38.64.199.33" or IPAddress == "41.144.68.21" or IPAddress == "41.189.45.166" or IPAddress == "41.189.52.14" or IPAddress == "41.189.53.94" or IPAddress == "41.202.71.27" or IPAddress == "41.202.78.237" or IPAddress == "41.202.90.185" or IPAddress == "41.207.11.79" or IPAddress == "41.207.2.186" or IPAddress == "41.207.203.238" or IPAddress == "41.207.220.170" or IPAddress == "41.207.220.57" or IPAddress == "41.207.24.201" or IPAddress == "41.207.64.49" or IPAddress == "41.38.18.230" or IPAddress == "41.66.35.238" or IPAddress == "41.66.39.42" or IPAddress == "41.79.173.47" or IPAddress == "41.86.46.245" or IPAddress == "42.117.2.85" or IPAddress == "45.124.65.51" or IPAddress == "45.127.92.179" or IPAddress == "45.46.51.81" or IPAddress == "45.55.136.31" or IPAddress == "46.151.52.191" or IPAddress == "46.151.52.61" or IPAddress == "46.16.200.133" or IPAddress == "46.161.2.60" or IPAddress == "46.161.40.102" or IPAddress == "46.161.40.106" or IPAddress == "46.165.222.231" or IPAddress == "46.19.136.211" or IPAddress == "46.22.128.133" or IPAddress == "46.22.134.78" or IPAddress == "46.31.43.57" or IPAddress == "46.33.54.45" or IPAddress == "46.4.150.111" or IPAddress == "46.4.203.213" or IPAddress == "5.100.249.215" or IPAddress == "5.135.28.113" or IPAddress == "5.139.154.42" or IPAddress == "5.152.199.70" or IPAddress == "5.152.201.19" or IPAddress == "5.172.193.101" or IPAddress == "5.187.0.137" or IPAddress == "5.187.193.224" or IPAddress == "5.187.4.183" or IPAddress == "5.196.249.163" or IPAddress == "5.206.225.104" or IPAddress == "5.9.253.173" or IPAddress == "5.9.82.18" or IPAddress == "50.62.233.1" or IPAddress == "52.39.53.151" or IPAddress == "58.195.1.4" or IPAddress == "59.157.4.2" or IPAddress == "60.13.186.5" or IPAddress == "60.241.184.209" or IPAddress == "60.249.31.231" or IPAddress == "61.14.209.167" or IPAddress == "61.47.43.241" or IPAddress == "62.76.191.108" or IPAddress == "63.249.152.74" or IPAddress == "63.250.54.134" or IPAddress == "64.127.71.73" or IPAddress == "64.182.215.68" or IPAddress == "64.182.6.61" or IPAddress == "64.76.19.244" or IPAddress == "64.76.19.251" or IPAddress == "64.85.233.8" or IPAddress == "69.118.144.195" or IPAddress == "69.144.171.44" or IPAddress == "69.15.194.26" or IPAddress == "69.23.87.56" or IPAddress == "72.167.245.34" or IPAddress == "72.230.82.80" or IPAddress == "72.41.18.212" or IPAddress == "73.72.208.195" or IPAddress == "74.119.194.18" or IPAddress == "74.62.209.104" or IPAddress == "78.138.104.167" or IPAddress == "78.46.222.241" or IPAddress == "80.65.93.241" or IPAddress == "81.177.180.101" or IPAddress == "82.196.3.245" or IPAddress == "83.15.254.242" or IPAddress == "83.212.117.233" or IPAddress == "83.69.233.121" or IPAddress == "87.236.210.110" or IPAddress == "87.236.210.124" or IPAddress == "87.237.198.245" or IPAddress == "87.246.143.242" or IPAddress == "87.254.167.37" or IPAddress == "89.40.181.101" or IPAddress == "90.80.231.36" or IPAddress == "91.108.176.118" or IPAddress == "91.121.240.111" or IPAddress == "91.121.240.97" or IPAddress == "91.195.12.143" or IPAddress == "91.201.155.96" or IPAddress == "91.224.141.11" or IPAddress == "91.236.213.74" or IPAddress == "91.236.75.11" or IPAddress == "92.53.119.248" or IPAddress == "92.53.124.62" or IPAddress == "93.171.205.12" or IPAddress == "94.103.36.55" or IPAddress == "95.211.153.134" or IPAddress == "98.126.6.83" or IPAddress == "98.131.185.136" or IPAddress == "192.42.119.41" or IPAddress == "23.254.203.51" or IPAddress == "212.83.166.45" or IPAddress == "173.230.136.67" or IPAddress == "173.224.218.25" or IPAddress == "104.227.137.34" or IPAddress == "137.74.254.64" or IPAddress == "188.165.220.214" or IPAddress == "85.143.221.180" or IPAddress == "119.82.27.246" or IPAddress == "194.88.246.7" or IPAddress == "206.214.220.79" or IPAddress == "104.236.2.253" or IPAddress == "62.39.95.185"
| project TimeGenerated, IPAddress , Location , Identity, UserPrincipalName, LocationDetails , ClientAppUsed , DeviceDetail, ConditionalAccessPolicies;
azureSignIns
| extend locationString= strcat(tostring(LocationDetails["countryOrRegion"]), "/", tostring(LocationDetails["state"]), "/", tostring(LocationDetails["city"]), ";" , tostring(LocationDetails["geoCoordinates"]))
| order by locationString, IPAddress desc
| extend AccountCustomEntity = UserPrincipalName
| extend HostCustomEntity = Identity
| extend IPCustomEntity = IPAddress