SigninLogs 
| where TimeGenerated >= ago(30d)
| where ResultType == "50057" 
| where ClientAppUsed contains "oth" 
| where ResultDescription == "User account is disabled. The account has been disabled by an administrator." 
| summarize disabledAccountLoginAttempts=count(), disabledAccountsTargeted=dcount(UserPrincipalName),applicationsTargeted=dcount(AppDisplayName), disabledAccountSet=makeset(UserPrincipalName), applicationSet=makeset(AppDisplayName)  by IPAddress//, timeslice=bin(TimeGenerated, 1d)
| order by disabledAccountLoginAttempts desc 
| join kind= leftouter (
    SigninLogs
    | where ResultType == 0
    | summarize successfulAccountSigninCount=dcount(UserPrincipalName), successfulAccountSigninSet=makeset(UserPrincipalName, 15) by IPAddress
    | where successfulAccountSigninCount <100
) on IPAddress  
| where successfulAccountSigninCount > 1
| where disabledAccountsTargeted > 1
| project successfulAccountSigninSet 